vegeta-cli/src/vegeta/aeromant/templates/rotor_mrf_static/com/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         {{ITERATIONS}};
deltaT          1;
writeControl    timeStep;
writeInterval   {{ITERATIONS}};
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        patches         ("body.*");
        rho             rhoInf;
        rhoInf          {{DENSITY}};
        CofR            ({{ROTOR_CENTER}});
    }
}

// ************************************************************************* //
